"""Комбінації слів

Створи програму, яка зчитує рядок, введений користувачем, а потім створює та виводить 5 випадкових рядків із символів цього рядка.

Наприклад, програма отримала слово 'hello', тоді вона повинна вивести 5 випадкових слів (рядків), складених із символів:

'h', 'e', 'l', 'l', 'o' → 'hlelo', 'olelh', 'loleh' …

Підказка: використай модуль random, щоб отримувати випадкові символи з рядка."""
import random

first_str = input("Введіть рядок: ")

for i in range(5):
    new_str = ''
    for j in first_str:
        new_str += random.choice(first_str)
    print(new_str)
