"""Напишіть програму яка визначає чи введений рядок паліндром. Тобто користувач має ввести
якийсь рядок з клавіатури, а вам потрібно перевірити чи це паліндром чи ні (Пробіли не враховуємо).
Паліндром - це слова, які абсолютно однаково читаються зліва направо і справа наліво. Наприклад:
tenet
"""
palindrome = input('Введіть рядок: ')

# #is_palindrome = False
# if palindrome == palindrome[::-1]:
#     #is_palindrome = True
#     print("Це палімдром")
# else:
#     print('Це не паліндром')

print("Це паліндром") if palindrome == palindrome[::-1] else print('Це не паліндром')
