"""Відбувається турнір між розробниками Java i Python. Переможець отримає торт. У команді
Java - X людей, а команді Python Y людей. Потрібно заздалегідь розрізати пиріг таким чином, щоб
можна було роздати шматочки пирога будь-якій команді, яка виграла змагання, при цьому кожному
учаснику цієї команди має дістатися однакова кількість шматочків торта. І так як не хочеться різати
пиріг на занадто дрібні шматочки, потрібно знайти мінімальне відповідне число. Напишіть програму,
яка допомагає знайти це число.
Програма повинна зчитувати розміри команд (два позитивні цілі числа Х і Y, кожне число вводиться на
окремому рядку) і виводити найменше число d, яке ділиться на обидва ці числа без залишку."""
from math import lcm, gcd

x = int(input("Введіть кількість гравців в команді Java: "))
y = int(input("Введіть кількість гравців в команді Python: "))

d = x * y // gcd(x, y)
#print(lcm(x, y))
print(d)


