"""Дано список списків із цілими числами (наприклад, [[1, 2, 3], [4, 5], [6]]).
Порахуйте, скільки парних і непарних чисел у кожному підсписку, і запишіть результати в новий список
кортежів, де кожен кортеж - це (кількість парних, кількість непарних).

На виході: # [(1, 2), (1, 1), (1, 0)]"""

lst = [[1, 2, 3], [4, 5], [6]]
lst1 = []

for i in lst:
    even = 0
    odd = 0
    for j in i:
        if j % 2 == 0:
            even += 1
        else:
            odd += 1
    lst1.append((even, odd))

print(lst1)
